Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.AutomaticScaling Property
 Gets or sets a value indicating whether the pull-out is scaled automatically or to a specified value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AutomaticScaling { get; set; }
Public Property AutomaticScaling As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace